
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 2 to change, 8 to destroy.</code></pre>

* Create
  * module.opal-fines-db.azurerm_postgresql_flexible_server.pgsql_server
  * module.opal-fines-db.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.opal-fines-db.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.opal-fines-db.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.opal-fines-db.azurerm_postgresql_flexible_server_database.pg_databases[&#34;opal&#34;]
  * module.opal-fines-db.azurerm_resource_group.rg[0]
  * module.opal-fines-db.null_resource.set-user-permissions-additionaldbs[&#34;opal&#34;]
  * module.opal-fines-db.random_password.password
* Update
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES_HOST
* Delete
  * module.opal_db.azurerm_postgresql_flexible_server.pgsql_server
  * module.opal_db.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.opal_db.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.opal_db.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.opal_db.azurerm_postgresql_flexible_server_database.pg_databases[&#34;opal&#34;]
  * module.opal_db.azurerm_resource_group.rg[0]
  * module.opal_db.null_resource.set-user-permissions-additionaldbs[&#34;opal&#34;]
  * module.opal_db.random_password.password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
        id                      = "https://opal-stg.vault.azure.net/secrets/account-enquiry-POSTGRES-PASS/a9a617d90b404338b398f74563bc4f32"
        name                    = "account-enquiry-POSTGRES-PASS"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://opal-stg.vault.azure.net/secrets/account-enquiry-POSTGRES-HOST/f1e8af9e912840b4bd0fa560dd0e423e"
        name                    = "account-enquiry-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.opal-fines-db.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + auto_grow_enabled             = false
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "opal-account-enquiry-stg"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "opal-account-enquiry-data-stg"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "opal"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/opal-account-enquiry.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#opal-help"
          + "environment"         = "staging"
          + "managedBy"           = "Green on Black"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.opal-fines-db.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "opal-account-enquiry-data-stg"
      + server_name         = "opal-account-enquiry-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.opal-fines-db.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01"
      + principal_name      = "jenkins-ptl-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "opal-account-enquiry-data-stg"
      + server_name         = "opal-account-enquiry-stg"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.opal-fines-db.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.opal-fines-db.azurerm_postgresql_flexible_server_database.pg_databases["opal"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "opal"
      + server_id = (known after apply)
    }

  # module.opal-fines-db.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "opal-account-enquiry-data-stg"
      + tags     = {
          + "application"         = "opal"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/opal-account-enquiry.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#opal-help"
          + "environment"         = "staging"
          + "managedBy"           = "Green on Black"
        }
    }

  # module.opal-fines-db.null_resource.set-user-permissions-additionaldbs["opal"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS SDS DB Access Reader"
          + "force_trigger"  = ""
          + "name"           = "opal-account-enquiry"
          + "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        }
    }

  # module.opal-fines-db.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.opal_db.azurerm_postgresql_flexible_server.pgsql_server will be destroyed
  # (because azurerm_postgresql_flexible_server.pgsql_server is not in configuration)
  - resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      - administrator_login           = "pgadmin" -> null
      - administrator_password        = (sensitive value) -> null
      - auto_grow_enabled             = false -> null
      - backup_retention_days         = 35 -> null
      - create_mode                   = "Default" -> null
      - delegated_subnet_id           = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.Network/virtualNetworks/ss-stg-vnet/subnets/postgresql" -> null
      - fqdn                          = "opal-account-enquiry-stg.postgres.database.azure.com" -> null
      - geo_redundant_backup_enabled  = false -> null
      - id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-account-enquiry-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-account-enquiry-stg" -> null
      - location                      = "uksouth" -> null
      - name                          = "opal-account-enquiry-stg" -> null
      - private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com" -> null
      - public_network_access_enabled = false -> null
      - resource_group_name           = "opal-account-enquiry-data-stg" -> null
      - sku_name                      = "GP_Standard_D2s_v3" -> null
      - storage_mb                    = 65536 -> null
      - tags                          = {
          - "application"         = "opal"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/opal-account-enquiry.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#opal-help"
          - "environment"         = "staging"
          - "managedBy"           = "Green on Black"
        } -> null
      - version                       = "15" -> null
      - zone                          = "1" -> null

      - authentication {
          - active_directory_auth_enabled = true -> null
          - password_auth_enabled         = true -> null
          - tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
        }

      - high_availability {
          - mode                      = "ZoneRedundant" -> null
          - standby_availability_zone = "2" -> null
        }

      - maintenance_window {
          - day_of_week  = 0 -> null
          - start_hour   = 3 -> null
          - start_minute = 0 -> null
        }
    }

  # module.opal_db.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be destroyed
  # (because azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-account-enquiry-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-account-enquiry-stg/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789" -> null
      - principal_name      = "DTS Platform Operations" -> null
      - principal_type      = "Group" -> null
      - resource_group_name = "opal-account-enquiry-data-stg" -> null
      - server_name         = "opal-account-enquiry-stg" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.opal_db.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be destroyed
  # (because azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin is not in configuration)
  - resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-account-enquiry-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-account-enquiry-stg/administrators/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> null
      - object_id           = "7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> null
      - principal_name      = "jenkins-ptl-mi" -> null
      - principal_type      = "ServicePrincipal" -> null
      - resource_group_name = "opal-account-enquiry-data-stg" -> null
      - server_name         = "opal-account-enquiry-stg" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.opal_db.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be destroyed
  # (because azurerm_postgresql_flexible_server_configuration.pgsql_server_config is not in configuration)
  - resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      - id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-account-enquiry-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-account-enquiry-stg/configurations/backslash_quote" -> null
      - name      = "backslash_quote" -> null
      - server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-account-enquiry-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-account-enquiry-stg" -> null
      - value     = "on" -> null
    }

  # module.opal_db.azurerm_postgresql_flexible_server_database.pg_databases["opal"] will be destroyed
  # (because azurerm_postgresql_flexible_server_database.pg_databases is not in configuration)
  - resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      - charset   = "UTF8" -> null
      - collation = "en_GB.utf8" -> null
      - id        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-account-enquiry-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-account-enquiry-stg/databases/opal" -> null
      - name      = "opal" -> null
      - server_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-account-enquiry-data-stg/providers/Microsoft.DBforPostgreSQL/flexibleServers/opal-account-enquiry-stg" -> null
    }

  # module.opal_db.azurerm_resource_group.rg[0] will be destroyed
  # (because azurerm_resource_group.rg is not in configuration)
  - resource "azurerm_resource_group" "rg" {
      - id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/opal-account-enquiry-data-stg" -> null
      - location = "uksouth" -> null
      - name     = "opal-account-enquiry-data-stg" -> null
      - tags     = {
          - "application"         = "opal"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/opal-account-enquiry.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#opal-help"
          - "environment"         = "staging"
          - "managedBy"           = "Green on Black"
        } -> null
    }

  # module.opal_db.null_resource.set-user-permissions-additionaldbs["opal"] will be destroyed
  # (because null_resource.set-user-permissions-additionaldbs is not in configuration)
  - resource "null_resource" "set-user-permissions-additionaldbs" {
      - id       = "6099288128277875674" -> null
      - triggers = {
          - "db_reader_user" = "DTS SDS DB Access Reader"
          - "force_trigger"  = ""
          - "name"           = "opal-account-enquiry"
          - "script_hash"    = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc"
        } -> null
    }

  # module.opal_db.random_password.password will be destroyed
  # (because random_password.password is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - length           = 20 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "()-_" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

Plan: 8 to add, 2 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":28,"Program":"tfcmt","SHA1":"","Vars":{}} -->